app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos"."commentCount" DESC
---
    def index
        @photos = Photo.order(commentCount: :desc)